/*
::::::::::::::::::::::::::::::::::::::::::::::::::::::
プログラム名	：自己紹介
クラス記号		：IT11A723
出席番号		：０１
作成者			：細見　祐
作成日			：２０１７/０４/２０（日付記入日
仕様			：最初に作ったほうです
::::::::::::::::::::::::::::::::::::::::::::::::::::::
*/
#include<stdio.h>
int main(void)
{
	printf("初めてのC言語\n");
	printf("ここから２行目\n\n");
	printf("今から僕、細見祐の自己紹介をします\n");
	printf("性格はおおらかで何事もなるようになると思っているところがありますが\n");
	printf("その方針は変えていきたいと思ってます。\n");
	printf("趣味はゲーム→動画→本の順番に好きです！\n");
	printf("HAL大阪に入学する前は電子専門学校にかよっていてPCはちょっとはできます\n");
	printf("今はHALでの学校生活を探り探りやって生活しています。\n");
	printf("これって誰に向けて書いてるんだろうか？（返事はないだろうｗ）\n");
	printf("これにて自己紹介？？？を終わります。\n");
	printf("ここまで書いたんですがまだまだ時間がありそうなんで終わりまで何か書きます\n");
	printf("子供の頃の話をします僕は保育園の頃から親のおさがりのPCを使って教育系のゲームをしていました、\n");
	printf("思えばその頃から電子機器に興味を持ち始めて小学校になってずっとパソコンをしていたら\n");
	printf("制限をつけられるようになりましたｗ\n");
	printf("そのこともありパソコンはあまり触らなくなり読書にばかりの時期が中学まで続きます\n");
	printf(" 中学頃になると制限もなくなり触る機会も増えたことでゲーム廃人になりかけ？");
	printf("（なってたかも\nそれからはそういったことに興味を持ったことで↑の高校に入学しました\n");
	printf("そこからも色々ありましたがそういった経緯で今この場所にいます、\n\nそろそろ時間なので終わりにします！\n");
	//今気づいたこれソースコード汚いな、改行のためにもう一度Printfコピペする必要なかった^^:


		rewind(stdin);
			printf("\n\n\n\n\nEnterキーを押すと終了します。");
			getchar();
}	