/*
::::::::::::::::::::::::::::::::::::::::::::::::::::::
プログラム名	：自己紹介
クラス記号		：IT11A723
出席番号		：０１
作成者			：細見　祐
作成日			：２０１７/０４/２０（日付記入日
仕様			：PC壊れて作り直したほうです。
田中先生へ		：どれくらいの距離感？で書いたらいいかわからなかったです
::::::::::::::::::::::::::::::::::::::::::::::::::::::
*/
#include<stdio.h>
int main(void)		//このあたりあってるのか不安うろ覚えで書いてます
{
	printf("このプログラムはVisual Studioが入った学校用PCが4/23の23時ごろに壊れたため泣きながらメモ帳で書いてます現在時刻00:22\n\n");
	printf("それでは自己紹介します、、、僕の名前は細見　祐（ほそみ　たすく）よくキラキラネームとか言われてますｗ\n\n");
	printf("好きなことははゲーム、読書、アニメ、映画、テレビ、カラオケetc、面白ければなんでも好きです！\n");
	printf("そんな僕が電子機器に興味を持ったのは多分、保育園時代です。\n\n");
	printf("その頃に親の使っていたWindows2000のPCで教育系のゲームをしてからPCというものにハマってたと思います。\n\n");
	printf("それからは機械類は一切触らせてもらえない生活（PC,TV,ゲーム等)が中学くらいまで続きその間はずっと読書をしていました。\n");
	printf("その反動か中学～は廃人の如くゲームをして高校は電子専門の学校に入り（今思えばここが過ちだった）色々あってなんとかHALに入学できました。\n\n");
	printf("今日CLの時間にこのメモ帳じゃなく学校用PCの自己紹介プログラムを提出できてることを祈ります、、\n\n");
	printf("現在PCのデータ救出中で終わったらPCのリカバリをかけるつもりです、今日はオールかもしれません、、、\n");
	rewind(stdin);
		printf("\nEnterキーを押すと終了します。");
	getchar();

	return 0;		//半角スペースをかんたんに打つ方法ってありますか？？
}